Repository: kyle41io/PyEz-Learning
Catalog: locale/*/LC_MESSAGES/django.po
Languages: vi

source: Dashboard
vi: Bảng điều khiển

source: Curriculum
vi: Chương trình giảng dạy

source: Progress
vi: Tiến độ

source: Teaching Content
vi: Nội dung giảng dạy

source: Stars
vi: Sao

source: My Profile
vi: Hồ sơ của tôi

source: Settings
vi: Cài đặt

source: Sign Out
vi: Đăng xuất

source: About PyEz
vi: Về PyEz

source: Support
vi: Hỗ trợ

source: Python Tips
vi: Mẹo Python

source: First, solve the problem. Then, write the code.
vi: Trước tiên, giải quyết vấn đề. Sau đó, viết mã.

source: PyEz Learning System
vi: Hệ thống học tập PyEz

source: Python Learning Platform
vi: Nền tảng học tập Python

source: Learn Python
vi: Học Python

source: The Easy Way
vi: Cách dễ dàng

source: Master Python programming with interactive lessons, real-world projects, and a supportive community. Start your coding journey today!
vi: Làm chủ lập trình Python với các bài học tương tác, dự án thực tế và một cộng đồng hỗ trợ. Bắt đầu hành trình mã hóa của bạn ngay hôm nay!

source: Get Started Free
vi: Bắt đầu miễn phí

source: Learn More
vi: Tìm hiểu thêm

source: Interactive Lessons
vi: Bài học tương tác

source: Learn Python step by step with interactive lessons and real-time feedback.
vi: Học Python từng bước với các bài học tương tác và phản hồi theo thời gian thực.

source: Track Progress
vi: Theo dõi tiến độ

source: Earn stars, climb leaderboards, and celebrate your coding milestones.
vi: Kiếm sao, leo bảng xếp hạng và ăn mừng những cột mốc mã hóa của bạn.

source: Expert Teachers
vi: Giáo viên chuyên gia

source: Learn from experienced Python developers and educators.
vi: Học từ những nhà phát triển Python và nhà giáo dục có kinh nghiệm.

source: Sign In
vi: Đăng nhập

source: Sign Up
vi: Đăng ký

source: Welcome Back
vi: Chào mừng trở lại

source: Email or Username
vi: Email hoặc Tên người dùng

source: Password
vi: Mật khẩu

source: Create Your Account
vi: Tạo tài khoản của bạn

source: First Name
vi: Tên

source: Last Name
vi: Họ

source: Username
vi: Tên người dùng

source: Profile Picture
vi: Ảnh hồ sơ

source: optional
vi: tùy chọn

source: Confirm Password
vi: Xác nhận mật khẩu

source: Create Account
vi: Tạo tài khoản

source: Don't have an account?
vi: Không có tài khoản?

source: Already have an account?
vi: Đã có tài khoản?

source: Note:
vi: Ghi chú:

source: New accounts are created as Student role by default. Contact an administrator if you need Teacher access.
vi: Các tài khoản mới được tạo với vai trò Học sinh theo mặc định. Liên hệ với quản trị viên nếu bạn cần quyền truy cập Giáo viên.

source: or
vi: hoặc

source: Sign in with Google
vi: Đăng nhập bằng Google

source: Edit Profile
vi: Chỉnh sửa hồ sơ

source: Bio
vi: Tiểu sử

source: Change Password
vi: Đổi mật khẩu

source: Current Password
vi: Mật khẩu hiện tại

source: New Password
vi: Mật khẩu mới

source: Confirm New Password
vi: Xác nhận mật khẩu mới

source: Save Changes
vi: Lưu thay đổi

source: Cancel
vi: Hủy

source: Account Information
vi: Thông tin tài khoản

source: Email Address
vi: Địa chỉ email

source: Email cannot be changed
vi: Email không thể thay đổi

source: Username cannot be changed
vi: Tên người dùng không thể thay đổi

source: Account Role
vi: Vai trò tài khoản

source: Contact an administrator to change your role
vi: Liên hệ với quản trị viên để thay đổi vai trò của bạn

source: Member Since
vi: Thành viên kể từ

source: ago
vi: trước đây

source: Active
vi: Hoạt động

source: Account Status
vi: Trạng thái tài khoản

source: Joined
vi: Tham gia

source: Upload an image file. Changes will appear after saving.
vi: Tải lên một tệp hình ảnh. Các thay đổi sẽ xuất hiện sau khi lưu.

source: Tell us about yourself - this will be visible on your profile
vi: Cho chúng tôi biết về bạn - điều này sẽ hiển thị trên hồ sơ của bạn

source: Required for security verification
vi: Bắt buộc để xác minh bảo mật

source: Leave blank if you don't want to change your password
vi: Để trống nếu bạn không muốn thay đổi mật khẩu

source: Hot & Active Events
vi: Sự kiện Nóng & Hoạt động

source: Ends
vi: Kết thúc

source: Start Now
vi: Bắt đầu ngay

source: No stress! There are no active exams right now.
vi: Không lo! Hiện tại không có bài kiểm tra nào hoạt động.

source: My Progress
vi: Tiến độ của tôi

source: You have completed
vi: Bạn đã hoàn thành

source: out of
vi: từ

source: lessons.
vi: bài học.

source: Continue Learning
vi: Tiếp tục học

source: My Stars
vi: Sao của tôi

source: Total Stars Earned
vi: Tổng số sao kiếm được

source: Active Learner
vi: Người học hoạt động

source: Leaderboard
vi: Bảng xếp hạng

source: Student
vi: Học sinh

source: Be the first to join the leaderboard!
vi: Hãy là người đầu tiên tham gia bảng xếp hạng!

source: View All Students
vi: Xem tất cả học sinh

source: Theme Color
vi: Màu chủ đề

source: Language
vi: Ngôn ngữ

source: Dark mode
vi: Chế độ tối

source: Footer title
vi: Vui vẻ, yêu thương và mã

source: Student User
vi: Người dùng học sinh

source: Teacher management
vi: Quản lý giáo viên

source: Class Management
vi: Quản lý lớp học

source: Teacher Management
vi: Quản lý giáo viên

source: All Students
vi: Tất cả học sinh

source: Average Student Progress
vi: Tiến độ trung bình của học sinh

source: My Exams
vi: Bài kiểm tra của tôi

source: Manage students by class
vi: Quản lý học sinh theo lớp

source: students
vi: học sinh

source: Students
vi: Học sinh

source: View class details
vi: Xem chi tiết lớp

source: Class
vi: Lớp

source: Class Filter
vi: Lọc theo lớp

source: All Classes
vi: Tất cả lớp

source: Status Filter
vi: Lọc theo trạng thái

source: All Status
vi: Tất cả trạng thái

source: Inactive
vi: Không hoạt động

source: Unassigned
vi: Chưa phân lớp

source: Progress Filter
vi: Lọc theo tiến độ

source: Stars Filter
vi: Lọc theo sao

source: Apply Filters
vi: Áp dụng bộ lọc

source: Reset
vi: Đặt lại

source: No students found
vi: Không tìm thấy học sinh

source: Try adjusting your filters or check back later.
vi: Thử điều chỉnh bộ lọc hoặc kiểm tra lại sau.

source: Are you sure you want to change this student's status?
vi: Bạn có chắc chắn muốn thay đổi trạng thái của học sinh này?

source: Are you sure you want to change this teacher's status?
vi: Bạn có chắc chắn muốn thay đổi trạng thái của giáo viên này?

source: Failed to update student status
vi: Không thể cập nhật trạng thái học sinh

source: Failed to update teacher status
vi: Không thể cập nhật trạng thái giáo viên

source: An error occurred
vi: Đã xảy ra lỗi

source: Deactivate
vi: Vô hiệu hóa

source: Activate
vi: Kích hoạt

source: All Progress
vi: Tất cả tiến độ

source: All Stars
vi: Tất cả sao

source: Select an option
vi: Chọn một tùy chọn

source: Select your class
vi: Chọn lớp của bạn

source: Select gender
vi: Chọn giới tính

source: Gender
vi: Giới tính

source: Unassigned Students
vi: Học sinh chưa phân lớp

source: Total Students:
vi: Tổng số học sinh:

source: Search by Name
vi: Tìm kiếm theo tên

source: Enter name or username
vi: Nhập tên hoặc tên người dùng

source: Status
vi: Trạng thái

source: Actions
vi: Hành động

source: Contact
vi: Liên hệ

source: Stats
vi: Thống kê

source: Create Teacher Account
vi: Tạo tài khoản giáo viên

source: Create Teacher
vi: Tạo giáo viên

source: Teachers
vi: Giáo viên

source: No teachers created yet.
vi: Chưa tạo giáo viên nào.

source: Teacher
vi: Giáo viên

source: Python Programming Curriculum
vi: Chương trình học Python

source: Total Lessons:
vi: Tổng bài học:

source: Locked
vi: Đã khóa

source: Completed
vi: Hoàn thành

source: stars
vi: sao

source: Bonus stars
vi: Sao thưởng

source: Video Lecture
vi: Video bài giảng

source: Quiz Test
vi: Bài kiểm tra

source: questions
vi: câu hỏi

source: Coding Challenge
vi: Thử thách lập trình

source: problems
vi: bài toán

source: Interactive Game
vi: Trò chơi tương tác

source: No lessons available yet
vi: Chưa có bài học

source: Lessons will be added soon!
vi: Sẽ thêm bài học sớm!

source: Track your learning journey and achievements
vi: Theo dõi học tập & thành tích

source: Overall Progress
vi: Tiến độ chung

source: Completed Lessons
vi: Bài đã hoàn thành

source: Exams Taken
vi: Bài thi đã làm

source: Complete
vi: Hoàn thành

source: Rank
vi: Hạng

source: Curriculum Progress
vi: Tiến độ học tập

source: Lesson
vi: Bài

source: In Progress
vi: Đang học

source: Quiz
vi: Kiểm tra

source: Coding
vi: Lập trình

source: Completed on
vi: Hoàn thành

source: Exam Results
vi: Kết quả thi

source: Exam
vi: Bài thi

source: Score
vi: Điểm

source: Date
vi: Ngày

source: Multiple Choice
vi: Trắc nghiệm

source: Coding Test
vi: Thi code

source: of
vi: trong

source: No exams taken yet
vi: Chưa thi bài nào

source: Complete exams to see your results here
vi: Làm bài thi để xem kết quả

source: Go to Dashboard
vi: Về trang chủ

source: Amazing! You've completed all lessons! Keep practicing with exams.
vi: Tuyệt vời! Bạn đã hoàn thành tất cả bài học!

source: Great progress! You're almost there!
vi: Tiến bộ tốt! Sắp xong rồi!

source: You're halfway there! Keep going!
vi: Đã qua nửa đường! Cố lên!

source: Good start! Keep up the momentum!
vi: Khởi đầu tốt! Tiếp tục nào!

source: Start your learning journey today!
vi: Bắt đầu học ngay hôm nay!

source: Navigation
vi: Điều hướng

source: My Class
vi: Lớp của tôi

source: Already Submitted
vi: Đã nộp bài

source: You have already submitted this exam.
vi: Bạn đã nộp bài thi này

source: Your Score
vi: Điểm của bạn

source: Stars Earned
vi: Sao nhận được

source: Submitted
vi: Đã nộp

source: Back to Dashboard
vi: Về trang chủ

source: Access Denied
vi: Từ chối truy cập

source: You are not allowed to access this exam. It may be restricted to specific classes.
vi: Bạn không được phép thi bài này

source: This exam has been ended by the teacher.
vi: Giáo viên đã kết thúc bài thi

source: This exam has ended.
vi: Bài thi đã kết thúc

source: This exam is not currently available.
vi: Bài thi chưa mở

source: Start
vi: Bắt đầu

source: End
vi: Kết thúc

source: Back to Exams List
vi: Về danh sách thi

source: Results
vi: Kết quả

source: Type
vi: Loại

source: Submissions
vi: Bài nộp

source: Avg Score
vi: Điểm TB

source: Max Stars
vi: Sao tối đa

source: Student Submissions
vi: Bài nộp học sinh

source: Submitted At
vi: Thời gian nộp

source: No submissions yet
vi: Chưa có bài nộp

source: Time Remaining
vi: Thời gian còn

source: The exam will auto-submit when time expires
vi: Bài thi tự động nộp khi hết giờ

source: Duration
vi: Thời lượng

source: minutes
vi: phút

source: Max
vi: Tối đa

source: Time is up! Your exam will be submitted automatically.
vi: Hết giờ! Bài thi sẽ tự động nộp

source: Running...
vi: Đang chạy...

source: Executing code...
vi: Đang thực thi...

source: Run & Test
vi: Chạy & Kiểm tra

source: Error running code
vi: Lỗi chạy code

source: All tests passed!
vi: Đạt tất cả test!

source: Solved
vi: Đã giải

source: Submitting...
vi: Đang nộp...

source: Error
vi: Lỗi

source: Submit
vi: Nộp bài

source: Error submitting exam
vi: Lỗi nộp bài thi

source: Exam Submitted!
vi: Đã nộp bài!

source: Back to Teaching Content
vi: Về nội dung giảng dạy

source: Create New Exam
vi: Tạo bài thi mới

source: Exam Type
vi: Loại bài thi

source: Multiple Choice Test
vi: Trắc nghiệm

source: Exam Title
vi: Tên bài thi

source: Max Stars Points
vi: Sao tối đa

source: Duration (minutes)
vi: Thời lượng (phút)

source: Start Time (optional)
vi: Thời gian bắt đầu

source: Leave empty for exam to be available immediately
vi: Để trống để mở ngay

source: End Time (optional)
vi: Thời gian kết thúc

source: Leave empty for exam to always be available (you can end it manually later)
vi: Để trống để mở luôn

source: Allowed Classes (hold Ctrl/Cmd to select multiple)
vi: Lớp được thi

source: Leave empty to allow all students
vi: Để trống cho tất cả

source: Password (optional)
vi: Mật khẩu

source: Questions/Problems (JSON format)
vi: Câu hỏi (JSON)

source: Paste questions in JSON format here...
vi: Dán câu hỏi JSON vào đây...

source: View JSON Format Examples
vi: Xem ví dụ JSON

source: Multiple Choice Format
vi: Định dạng trắc nghiệm
